comissioning.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:epcglobal:epcis:xsd:1" xmlns:stan="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader">
   <soapenv:Header/>
   <soapenv:Body>
      <epcis:EPCISDocument creationDate="2018-10-10T16:59:14Z" schemaVersion="1.1" xmlns:epcis="urn:epcglobal:epcis:xsd:1" xmlns:gs1ushc="http://epcis.gs1us.org/hc/ns" xmlns:sbdh="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader">
         <EPCISHeader>
            <SAPHeaderExtension>
               <SAPQueueMessageSender>ProductionLine</SAPQueueMessageSender>
            </SAPHeaderExtension>
         </EPCISHeader>
         <EPCISBody>
            <EventList>
               <ObjectEvent>
                  <eventTime>2018-10-10T16:59:13.3975120Z</eventTime>
                  <eventTimeZoneOffset>+01:00</eventTimeZoneOffset>
                  <epcList>
                     <epc>(01)00000193006193(21)9977205360011</epc>
                     <epc>(01)00000193006193(21)9976535921881</epc>
                   </epcList>
                  <action>ADD</action>
                  <bizStep>urn:epcglobal:cbv:bizstep:commissioning</bizStep>
                  <disposition>urn:epcglobal:cbv:disp:active</disposition>
                  <readPoint>
                     <id>urn:epc:id:sgln:0000</id>
                  </readPoint>
                  <bizLocation>
                     <id>urn:epc:id:sgln:0000</id>
                  </bizLocation>
                  <bizTransactionList>
                  <bizTransaction type = urn:epcglobal:cbv:btt:prodorder >
                                 urn:epcglobal:cbv:bt:00001
                  </bizTransactionList/>
                  <extension>
                     <quantityList/>
                     <sourceList/>
                     <destinationList/>
                  </extension>
                  <SAPExtension>
                     <objAttributes>
                        <DATMF>20181010</DATMF>
                     </objAttributes>
                     <objAttGroupList>
                        <objAttGroup>
                           <objectList>
                                   <epc>(01)00002193006193(21)9977205360011</epc>
                                   <epc>(01)00002193006193(21)9976531921889</epc>
                           </objectList>
                           <objAttributes>
                              <LOTNO>Test111</LOTNO>
                              <DATEX>20191010</DATEX>
                           </objAttributes>
                        </objAttGroup>
                     </objAttGroupList>
                  </SAPExtension>
               </ObjectEvent>
            </EventList>
         </EPCISBody>
      </epcis:EPCISDocument>
   </soapenv:Body>
</soapenv:Envelope>
